src/main/resources/samples/DcsWebService.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://dcswebservice/wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:runUserQuery>
         <InterfaceSettings_1>
            <authenticationKey>#[flowVars.seko_authKey]</authenticationKey>
				<clientId>#[svcProp("clientId")]</clientId>
				<expirationSecs>#[svcProp("expiryTime")]</expirationSecs>
				<identifier>#[svcProp("identifier")]</identifier>
				<language>#[svcProp("language")]</language>
				<locality></locality>
				<nlsCalendar>Gregorian</nlsCalendar>
				<oracleDateFormat>yyyymmddhh24miss</oracleDateFormat>
				<password>#[flowVars.seko_password]</password>
				<referenceId>SEKO</referenceId>
				<serialiseMergeAccess>false</serialiseMergeAccess>
				<siteId>#[svcProp("siteId")]</siteId>
				<sqlTracing>false</sqlTracing>
				<stationId>WEB</stationId>
				<testMode>false</testMode>
				<timeOutSecs>300</timeOutSecs>
				<traceLevel>0</traceLevel>
				<transportUrl></transportUrl>
				<userId>#[svcProp("userId")]</userId>
         </InterfaceSettings_1>
         <QueryParameters_2>
            <maxRecords>#[svcProp("maxRecords")]</maxRecords>
            <nlsCalendar>Gregorian</nlsCalendar>
            <query>SELECT              SK.SKU_ID,
                    (SUM(NVL(FTS_QTY,0)*RES.BOX_QTY)-SUM(NVL(ON_PICK,0)*RES.BOX_QTY)) AVAILABLE_UNITS,
                    SUM(NVL(ON_HOLD,0)*RES.BOX_QTY) ON_HOLD_UNITS,
                    SUM(NVL(ON_PICK,0)*RES.BOX_QTY) ON_PICK_UNITS
FROM                SKU SK
LEFT JOIN
(SELECT             S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(I.CONFIG_ID) = 6 THEN SUBSTR(I.CONFIG_ID,1,1) ELSE SUBSTR(I.CONFIG_ID,1,2) END) BOX_QTY,
                    SUM(NVL(I.QTY_ON_HAND,0))FTS_QTY,
                    0 ON_HOLD,
                    0 ON_PICK,
                    0 DUE_IN
FROM                SKU S
INNER JOIN          INVENTORY I
ON                  I.SKU_ID = S.SKU_ID
AND                 I.CLIENT_ID = S.CLIENT_ID
INNER JOIN          LOCATION L
ON                  L.LOCATION_ID = I.LOCATION_ID
WHERE               I.CLIENT_ID = 'SATCHEL'
AND                 (L.LOC_TYPE NOT IN ('Receive Dock','Auto-ShipDock','Suspense','ShipDock','Stage','Sampling')
OR                  L.DISALLOW_ALLOC = 'N')
AND                 I.LOCK_STATUS = 'UnLocked'
GROUP BY            S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(I.CONFIG_ID) = 6 THEN SUBSTR(I.CONFIG_ID,1,1) ELSE SUBSTR(I.CONFIG_ID,1,2) END)
UNION ALL
SELECT              S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(I.CONFIG_ID) = 6 THEN SUBSTR(I.CONFIG_ID,1,1) ELSE SUBSTR(I.CONFIG_ID,1,2) END)BOX_QTY,
                    0 FTS_QTY,
                    SUM(CASE WHEN L.LOCATION_ID = 'CONTAINER' THEN 0 ELSE NVL(I.QTY_ON_HAND,0)END) ON_HOLD,
                    0 ON_PICK,
                    0 DUE_IN
FROM                SKU S
INNER JOIN          INVENTORY I
ON                  I.SKU_ID = S.SKU_ID
AND                 I.CLIENT_ID = S.CLIENT_ID
INNER JOIN          LOCATION L
ON                  L.LOCATION_ID = I.LOCATION_ID
WHERE               I.CLIENT_ID = 'SATCHEL'
AND                 ((L.LOC_TYPE IN ('Receive Dock','Stage','Sampling')
OR                  I.LOCK_STATUS = 'Locked'))
GROUP BY            S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(I.CONFIG_ID) = 6 THEN SUBSTR(I.CONFIG_ID,1,1) ELSE SUBSTR(I.CONFIG_ID,1,2) END)
UNION ALL
SELECT              S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(OL.CONFIG_ID) = 6 THEN SUBSTR(OL.CONFIG_ID,1,1) ELSE SUBSTR(OL.CONFIG_ID,1,2) END)BOX_QTY,
                    0,
                    0,
                    SUM(CASE WHEN OH.STATUS IN ('Released','Hold') THEN OL.QTY_ORDERED
                            WHEN OH.STATUS IN ('Allocated','In Progress','Picked','Complete') AND NVL(OL.QTY_ORDERED,0)!=(NVL(OL.QTY_TASKED,0)+NVL(OL.QTY_PICKED,0))
                            THEN (NVL(OL.QTY_ORDERED,0)-(NVL(OL.QTY_TASKED,0)+NVL(OL.QTY_PICKED,0)))+(NVL(OL.QTY_TASKED,0)+NVL(OL.QTY_PICKED,0))
                            ELSE (NVL(OL.QTY_TASKED,0)+NVL(OL.QTY_PICKED,0)) END)ON_PICK,
                    0
FROM                ORDER_HEADER OH
INNER JOIN          ORDER_LINE OL
ON                  OH.ORDER_ID = OL.ORDER_ID
AND                 OH.CLIENT_ID = OL.CLIENT_ID
AND                 OH.OWNER_ID = OL.OWNER_ID
INNER JOIN          SKU S
ON                  OL.SKU_ID = S.SKU_ID
AND                 OL.CLIENT_ID = S.CLIENT_ID
WHERE               STATUS IN ('Released','Hold','Allocated','In Progress','Picked','Complete')
AND                 OH.CLIENT_ID = 'SATCHEL'
GROUP BY            S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(OL.CONFIG_ID) = 6 THEN SUBSTR(OL.CONFIG_ID,1,1) ELSE SUBSTR(OL.CONFIG_ID,1,2) END)
UNION ALL
SELECT              S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(PL.CONFIG_ID) = 6 THEN SUBSTR(PL.CONFIG_ID,1,1) ELSE SUBSTR(PL.CONFIG_ID,1,2) END)BOX_QTY,
                    0,
                    0,
                    0,
                    SUM(NVL(PL.QTY_DUE,0))-SUM(NVL(PL.QTY_RECEIVED,0))DUE_IN
FROM                PRE_ADVICE_HEADER PH
INNER JOIN          PRE_ADVICE_LINE PL
ON                  PH.PRE_ADVICE_ID = PL.PRE_ADVICE_ID
AND                 PH.CLIENT_ID = PL.CLIENT_ID
AND                 PH.OWNER_ID = PL.OWNER_ID
INNER JOIN          SKU S
ON                  PL.SKU_ID = S.SKU_ID
AND                 PL.CLIENT_ID = S.CLIENT_ID
WHERE               PH.STATUS IN ('Released','In Progress')
AND                 PH.CLIENT_ID = 'SATCHEL'
GROUP BY            S.CLIENT_ID,
                    S.SKU_ID,
                    S.DESCRIPTION,
                    TO_NUMBER(CASE WHEN LENGTH(PL.CONFIG_ID) = 6 THEN SUBSTR(PL.CONFIG_ID,1,1) ELSE SUBSTR(PL.CONFIG_ID,1,2) END))RES
ON                  RES.SKU_ID = SK.SKU_ID
AND                 RES.CLIENT_ID = SK.CLIENT_ID
WHERE               SK.CLIENT_ID = 'SATCHEL'
GROUP BY            SK.SKU_ID
ORDER BY            SK.SKU_ID</query>
            <timeZoneName></timeZoneName>
         </QueryParameters_2>
      </wsdl:runUserQuery>
   </soapenv:Body>
</soapenv:Envelope>